const config = {
    name: ' سید پارسا حسینی',
    bio: 'برنامه نویس جنگو',
    instagram: 'https://instagram.com/seyed-parsa-jan',
    telegram: 'https://t.me/OseyedO',
    github: 'https://github.com/seyed-jan',
    email: '',
    cv: '',
    profileImage: 'profile.png',
    favicon: 'profile.png', 
    about: 'همه چی از کلاس ششم شروع شد. اون سالی که توی مدرسه بهمون یه ذره کوچولو icdl یاد میدادن. همون یه جرقه تو ذهنم شد که برم کامپیتر یاد بگیرم :) یادمه اون زمان استاد ورد و پاور پوینت و ... شده بودم😂 یه سال بعدش رفتم مغازه تعمیرات کامپیوتر و تا میتونستم یاد گرفتم :) تا جایی که دیگه دیدم چیزی برای یاد گرفتن ندارم. واسه همین رفتم سمت گرافیک و تدوین و موشن گرافیک 😁 خلاصه طی یه سری اتفاق ها اومدم سمت برنامه نویسی و الان 5 شیش سالی هست که برنامه نویسم 🙄🙃 الان هم به طرز عجیبی اومدم دانشگاه امام صادق و دارم اقتصاد میخونم. 😂😂',
    };

// const projects = [
//     {title:'پروژه اول',description:'توضیح کوتاه<br> پروژه اول',image:'profile.png',link:''},
//     {title:'پروژه دوم',description:'توضیح کوتاه پروژه دوم',image:'P2',link:''},
//     {title:'مینی پروژه',description:'یک کار کوچک و بامزه',image:'MP',link:''},
//     {title:'رندر ویدیو',description:'تدوین و صداگذاری نمونه',image:'VD',link:''},
//     {title:'پروژه اول',description:'توضیح کوتاه پروژه اول',image:'P1',link:''},
//     {title:'پروژه دوم',description:'توضیح کوتاه پروژه دوم',image:'P2',link:''},
//     {title:'مینی پروژه',description:'یک کار کوچک و بامزه',image:'MP',link:''},
//     {title:'رندر ویدیو',description:'تدوین و صداگذاری نمونه',image:'VD',link:''},
//     ];

const posts = [
  {
    title: "طراحی سایت",
    content: `امروز داشتم همینجوری فک میکردم، بعد به خودم گفتم تو که طراحی سایت بلدی، چرا برا خودت سایت نساختی تاحالا؟:)
    خببب! پول هاست و سرور نداشتم 😂😂
    اما یهو به ذهنم خورد که اِاِاِ! من گیت هاب که میزاره یه سایت استاتیک درست کنیم! چرا تاحالا نکرده بودم؟!
    خبب، شاید فقط از اون داینامیکا دوس داشتم :)
    ولی خب به هر حال زشته یه برنامه نویس وب خودش سایت نداشته باشه! اومدم اینو امروز ساختم. همین :)`,
    image: '', // اختیاری
    date: "1404/7/22"
  },
];
