const config = {
    name: ' سید پارسا حسینی',
    bio: 'برنامه نویس جنگو',
    instagram: 'https://instagram.com/seyed_parsa_jan',
    telegram: 'https://t.me/OseyedO',
    github: 'https://github.com/seyed-jan',
    email: '',
    cv: '',
    profileImage: 'profile.png',
    favicon: 'profile.png', 
    about: 'همه چی از کلاس ششم شروع شد. اون سالی که توی مدرسه بهمون یه ذره کوچولو icdl یاد میدادن. همون یه جرقه تو ذهنم شد که برم کامپیتر یاد بگیرم :) یادمه اون زمان استاد ورد و پاور پوینت و ... شده بودم😂 یه سال بعدش رفتم مغازه تعمیرات کامپیوتر و تا میتونستم یاد گرفتم :) تا جایی که دیگه دیدم چیزی برای یاد گرفتن ندارم. واسه همین رفتم سمت گرافیک و تدوین و موشن گرافیک 😁 خلاصه طی یه سری اتفاق ها اومدم سمت برنامه نویسی و الان 5 شیش سالی هست که برنامه نویسم 🙄🙃 الان هم به طرز عجیبی اومدم دانشگاه امام صادق و دارم اقتصاد میخونم. 😂😂',
    };

// const projects = [
//     {title:'پروژه اول',description:'توضیح کوتاه<br> پروژه اول',image:'profile.png',link:''},
//     {title:'پروژه دوم',description:'توضیح کوتاه پروژه دوم',image:'P2',link:''},
//     {title:'مینی پروژه',description:'یک کار کوچک و بامزه',image:'MP',link:''},
//     {title:'رندر ویدیو',description:'تدوین و صداگذاری نمونه',image:'VD',link:''},
//     {title:'پروژه اول',description:'توضیح کوتاه پروژه اول',image:'P1',link:''},
//     {title:'پروژه دوم',description:'توضیح کوتاه پروژه دوم',image:'P2',link:''},
//     {title:'مینی پروژه',description:'یک کار کوچک و بامزه',image:'MP',link:''},
//     {title:'رندر ویدیو',description:'تدوین و صداگذاری نمونه',image:'VD',link:''},
//     ];

const posts = [
  // {
  //   title: '',
  //   content: ``,
  //   image: '', // اختیاری
  //   date: "",
  // },
  {
    title: 'تخلیه تهران، کمبود آب. خصوصیات نداشته حکمرانان جامعه ایرانی اسلامی',
    content: `هر روز که توی این کانال های خبری گذر میکنیم، میبینیم یک شخصی مدام میگه به روز صفر آبی تهران نزدیک میشویم و ساکنین تهران، تهران رو ترک کنند و به شهر های خودشون برگردند. یعنی به صورت کامل صورت مسئله پاک میشود!
    قبل از اینکه بخوام در مورد این بنویسم، به نظرم بهتره یه مقدمه ای در مورد حکمرانی و خصوصیات فرد حکمران در جمهوری اسلامی بپردازم.
    هر جامعه ای نیاز به یک نظام حکمرانی و افرادی به عنوان حکمران دارد تا به مدیریت منابع کلان کشور و سمت سو دادن کلی به جامعه بپردازند.
    در هر جامعه ای، فرد حکمران باید خصوصیاتی داشته باشد. در یک جامعه ایرانی و اسلامی نیز این خصوصیات وجود دارد که اینها به این صورت هستند:
    1. مهم ترین خصوصیت، یعنی تقوا
    2. عنصر خلاقیت و توانایی حل مسئله از منظر های مختلف
    3. شجاعت تمام در مقابل اجرای تصمیم درست و در مقابله با حرف زور
    4. تدبیر در مورد موضوعات پیچیده به وجود آمده
    این 4 مورد، باید خصوصیات یک حکمران در یک جامعه ایرانی و اسلامی باشد.

    در مورد تقوا: اگر فرد حکمران تقوا نداشته باشد، به طور معمول منافع شخصی خود را به منافع جامعه و حکومت ترجیح میدهد. لذا در پایان منجر به فساد در سطح کلان در راستای منافع شخصی اش میباشد. به طور مثال، خیلی راحت فردی سودجو میتواند با پیشنهاد رشوه به فرد، یک تصمیم مهم کلان کشوری را به سمت و سویی نا متعارف بکشانند. درصورتی که اگر فرد تقوا داشته باشد، به هیچ وجه زیر بار این کار نمیرود و زندگی اخروی خود را فدای زندگی مادی و منافع شخصی خود نمیکند.
    در دولت فعلی: بندا تا به حال چیزی متناقض با این قضیه ندیدم. ان شاالله که نباشد، اما اگر هم باشد، احتمالا تا به حال صدایش در نیامده.
    
    در مورد خلاقیت: خلاقیت به معنی نگاه به مسائل از منظر دیگر است. هنگامی که فرد وارد فضای حکمرانی میشود، با مباحث و مسائلی مواجه میشود که شاید تا آن موقع با آن ها مواجه نشده بود. لذا فرد باید با خلاقیت خود، از مناظر دیگری به مسئله بپردازد و راه حل درست را پیدا کند.
    در دولت فعلی: خلاقیت دولت را در مسئله برق، آب و حتی در جنگ و مکانیزم ماشه همه مان مشاهده کردیم. در بخش بعدی در این مورد بیشتر صحبت میکنم.
    
    در مورد شجاعت: فرد حکمران باید در مقابل اجرای تصمیم درست شجاع باشد. چرا که هر تصمیم درست، افرادی سود جو را ناراحت میکند. همچنین در روابط بین المللی نیز این شجاعت در مقابل کشور های نادوست لازم است.
    در دولت فعلی: شجاعت دولت را در مواجه دولت با مسئله مکانیزم ماشه همه مان شاهد بودیم. شجاعت و اقتدار این دولت فقط در مقابل مردم خود بوده و تا به حال اقتداری در مقابل کشور های اروپایی و آمریکا شاهد نبودیم.
    
    در مورد تدبیر: وقتی کشور با مسئله مهمی (مانند آب) مواجه میشود، فرد یا افراد حکمران باید با تدبیر خود تلاش برای حل آن مسئله کنند.
    در دولت فعلی: تا به حال هر مشکلی در دولت به وجود آمده، یکی از حکمران های محترم تمام صحبتش این بوده -> شما بگویید من چکار کنم! آب را که من کم نکردم! تهران را تخلیه کنید! که توی این پست مخصوصا میخوام در این مورد صحبت کنم.
    
    با توجه به این اصول که یک حکمران ایرانی اسلامی باید داشته باشد، الان که در دولت فعلی نگاه میکنیم، میبینیم حداقل در 3 مورد از آن به شدت کم گذاشته اند. خلاقیت، شجاعت و تدبیر.
    بحث امروز در مورد آب است! فلذا بخش شجاعت رو کنار میزارم و فقط در مورد خلاقیت و تدبیر دولت فعلی صحبت میکنم.
    کشور با یک مشکلی مواجه شده به نام کمبود آب! خب، مسئولیت این با کیست؟ افراد دولت که تمام حرفشان این است: ما آب را تمام نکردیم که بخواهیم برگردانیم! خب درسته! شما آب رو تموم نکردین! اما این وظیفه حکمران جامعه هست که به هر نحوی این مشکل رو حل بکنه! حکمران باید خلاقیت و تدبیر داشته باشد! نه اینکه مدام در تلوزیون بگوید: شما بگویید من چکار کنم!
    اگر ما میدانستیم باید چکار کنیم خودمان اقدام به ثبت نام در انتخابات ریاست جمهوری میکردیم!! 
    اگر توانایی مدیریت را در خود نمیبینید، به چه حقی در انتخابات شرکت کردید و مملکت را در بی تدبیری و بی خلاقیتی خود غرق کردین؟؟
    آیا خالی کردن تهران راهکاریست که به اجماع رسیدید و میخواهید اجرا کنید؟ آیا خالی کردن تهران، مصرف آب کشور را کمتر میکند؟
    حالا کشور به این فاجعه کشیده شده و شما حکمران این کشور هستید، حکمران یک جامعه نیز مسئول 100 درصدی تمام اتفاقات خوشایند و غیر خوشایند داخل کشور است! اما تنها جوابی که تا به حال از حکمرانان شنیدیم این بوده: از تهران برید بیرون، فقط در 5 دقیقه حمام کنید، شما بگویید ما چکار کنیم، مگه ما آّ را تمام کردیم که از ما میخواهید؟!
    این حرف ها یعنی چه! حتی تا به حل یک عذر خواهی ساده به خاطر شرایط موجود از حکمرانان نشنیده ایم!
    شما که میبینی توانایی مدیریت این شرایط را نداشتی، چرا کاندید ریاست جمهوری شدی؟؟
    در زمان شما هم جنگ شد، هم قحطی برق، هم قحطی آب! در صورتی که میگفتید اگر افراد دیگر رای میاوردند این اتفاقات میوفتاد!! (بنده خودم به آقای جلیلی رای ندادم)
    
    با توجه به این شرایط، به گمانم شما حتی آن مهم ترین خصوصیت در جامعه ایرانی اسلامی یعنی تقوا را هم ندارید! فقط توانایی خواندن تعدادی آیات و روایات را از بر دارید!! چرا که اگر تقوا داشتید، وقتی میدیدید توانایی مدیریت جامعه را ندارید، اصلا کاندید ریاست جمهوری نمیشدید!
    رئیس جمهور شدن برای شما ظاهرا یک منفعت شخصی بود، نه منفعت عمومی در راه جامعه و اسلام!!`,
    image: '', // اختیاری
    date: "1404/8/17",
  },
  // {
  //   title: 'دانشجوی امام صادق، بعد از 7 سال درس خواندن!',
  //   content: `توی تمام دانشگاه ها، وقتی فرد یه مدت توش درس میخونه، تقریبا 80 درصد اون سال ها مفید و مربوط به رشته خودش هست! اما تو دانشگاه امام صادق اینطوری نیست! درصد زیادی از وقت و زمانی که برای درس گذاشتی حروم یه سری درس چرت و پرت و به درد نخور در دنیای امروز میشه! مثل چی؟ مثلا فقه، قواعد عربی، اندیشه اسلامی (توی همه دانشگاه ها هست، اما توی این دانشگاه خیلی جدی تر و سخت گیرانه تر هستت)، قرائت و تجوید، تاریخ اسلام و کلی درس دیگه که واقعا شاید هنوز باهاشون مواجه نشدم!
  //   جدای از این، هر دانشجو از هر دانشگاهی که فارغ التحصیل میشه، باید دنباله یه کد از وزارت علوم باشه! توضیح این کد اینجوریه:
  //       ** کد صحت مدرک تحصیلی، یک کد رهگیری رسمی است که توسط وزارت علوم صادر می‌شود و نشان می‌دهد مدرک شما معتبر، تأییدشده و قانونی‌ست. این کد برای نهادهای مختلف (مثل سازمان‌های دولتی، دانشگاه‌های دیگر، سفارت‌ها یا محل کار) قابل بررسی است و ثابت می‌کند که مدرک‌تان جعلی نیست و در سامانه وزارت علوم ثبت شده. **
  //   خب مشکل اینه که این کد رو برای دانشگاه امام صادق صادر نمیکنن! یعنی دانشجو بعد از 7 سال تحصیل میره روی هوا و باید تا یه مدت دنبال این کد بدو بدو بکنه! آخرش هم وقتی بعد یه مدت میبینه خبری نیست بیخیالش میشه و در مقطع دکتری در همون دانشگاه لعنتی ادامه به تحصیل میده!! :)
  //   خب جدی بعد از این چی میشه؟ وقتی کد صلاحیت مدرک رو نداری، تقریبا هیچ کاری نمیتونی بکنی! تحصیلاتت آکادمیک محسوب نمیشه و 7 سال از عمر خودت رو ریختی سطل آشغال.بعد تازه، جدا از اینکه 7 سال از عمرتو ریختی سطل آشغال، سنی بین 18 تا 26 سالگیت رو ریختی دور! ینی تو وقتی میای توی جامعه که یه پیرمرد شدی، و انگار از صفر شروع کردی :)
  //   خب این همه مسئول و وزیر و معاون وزیر چجوری امام صادق درس خوندن؟
  //   خب واضحه! یه چیزی داشتن به نام پارتی!! توی دانشگاه امام صادق بعد از اینکه درست تموم شد، اگه شانس بیاری و یه آشنا پیدا کنی تا تورو بدون اون کد لامصب توی دولت استخدامت کنه و مراحل رشد توی دیپلماسی رو بری جلو! در غیر این صورت خب هیچی که هیچی!
  //   گزینه دوم بعد از این ها دکتری هست! وقتی میبینی هیچ کاری برات نیست، مجبور میشی بری دکتری امتحان بدی و آخرش به خاطر همین کد دوباره توی همین دانشگاه ادامه به تحصیل بدی! حالا در این مورد اطلاع زیادی ندارم، چون دیدم کسایی رو که توی دانشگاه دیگه درس خوندن و نمیدونم چجوری :)
  //   این دسته افراد بعد از اینکه دکتری گرفتن، وقتی میبینن همچنان کاری براشون وجود نداره، به همین دانشگاه بر میگردن و شروع میکنن به تدریس قواعد عربی، فقه و همین چرت و پرت ها :) البته توی دانشگاه های دیگه هم میرن، ولی خب فک کن 13 سال درس میخونی (7 به علاوه 5 یا 6 به خاطر دکترا) و بعدش میری استاد دانشگاه میشی، به یه کوچولو حقوق :)
  //   معمولا از این دسته افراد که میپرسی چرا اومدی استاد شدی، میاد میگه به خاطر اسلام! به خاطر تربیت نیروی اسلامی مدیر! به خاطر تربیت نیروی مسلمان و عالم! ولی خب شر و بر نگو دیگه بابا بزرگ :) آیندت خراب شده دیگه!! همینجوری آینده ما هم داری خراب میکنی!!
  //   یه دسته سومی هم هستن که یه سری تحصیلات غیر آکادمیک و شخصی دارن، و آخرش یه جایی میرن سر کار و مشغول به کاری میشن که هیچ ربطی به تحصیلات آکادمیکت در دانشگاه نداره! مثل خود من :) من همه تحصیلات غیر آکادمیکم در مورد کامپیوتر و برنامه نویسیه! خیلی از وقت هایی که باید برای مدرسه درس میخوندم رو وقف این علوم کردم و الان دانشجو های کامپیوتر رو که میبینم، با خودم میگم اینایی که اینا الان دارن میخونن رو که من دو سه سال پیش تو مدرسه خودم خوندم :) در آخر هم توی یه شرکت به عنوان ادیتور دارم کار میکنم :) اینها هیچ ربطی به اقتصاد نداره!!
  //   یه دسته چهارم هم هست که وقتی از دانشگاه فارغ التحصیل میشن، عین یک انسان 18 ساله که تازه وارد جامعه شده، بدون تحصیلات آکادمیک و طلف کردن وقت، وارد جامعه میشه و رو به رانندگی اسنپ و حمالی های دیگه میاره :)
  //   خلاصه این پستم و دو سه تا پست دیگم اینه: اگه در آستانه دانشگاهی و یکی از گزینه هات دانشگاه امام صادق هست، خییلی بیشتر فکر کن! حتی اگه خواستی لینک تلگرامم رو اون بالا گذاشتم. روی اون کلید کن و بهم پیام بده تا بیشتر باهم حرف بزنیم!! آیندت رو خراب نکن :)
  //   این دانشگاه آنچنان که فکر میکنی و فکر میکنن خوب نیست! حتی امکان شست و شوی مغزیت توی این دانشگاه هم هست 😂 خود من هم شاید در همین آستانه باشم! فلذا خییلی بیشتر باید فکر کنی.
  //   در ضمن، این پست شاید یکی از آخرین پست هام باشه.
  //   خیلی وقته دارم به خودکشی و اینجور بحثا فک میکنم :)
  //   خدا بخیر کنه ...`,
  //   image: '', // اختیاری
  //   date: "1404/8/10"
  // },
  // {
  //   title: 'حیف، حیف استعدادم!',
  //   content: `الان یه سال از وقتی که به اجبار اومدم این دانشگاه گذشته و هنوز دارم کاری رو میکنم که هیچ ارتباطی با این دانشگاه و این رشته نداره، ینی برنامه نویسی :)
  //   هنوز که هنوزه وقتی بهش فکر میکنم گریم میگیره! منی که این همه سال عشقم کامپیوتر بود، صبح تا شب کارم برنامه نویسی بود، از هر کاری میزدم میومدم به جاش کد میزدم، چرا الان باید به اجبار بیام توی دانشگاهی که هیچ چیزی و هیچ کسی توی اون به روحیات من نمیخوره؟؟!
  //   فک کنم نیازه یه سری ویژگی ها از این دانشگاه رو بهتون بگم: اولا اینکه عموم افراد در سطح خیلی غیر قابل تصور به صورت افراطی مذهبی ان! اصلا نمیتونین تصور کنین!
  //   مورد دوم شعارشونه: وحدت حوزه و دانشگاه!! خب آخه اگه دروس حوزه به درد میخورد و کاربردی بود که دانشگاه ها تاسیس نمیشدن! حالا یه سری باید در مورد این یه مطلب جدا بنویسم!
  //   مورد بعدی سخت گیرانه بودن دانشگاه در سطح دانشگاه های بین المللی، در صورتی که اصلا جایگاه علمی خاصی توی جهان و حتی کشور نداره! در مورد این هم باید یه خورده بنویسم مثل اینکه!
  //   این دانشگاه واقعا فقط برای این ساخته شده که یه سری آخوند بعد از حوزه بیان اینجا!
  //   ولی خب خدا بیامرزه حاج آقا مهدوی کنی رو! هدف اصلی دانشگاه موقع تاسیس این نبود! باید یه خورده در مورد این هم بنویسم!! اون زمان اساتیدی میومدن توی دانشگاه تدریس میکردن که واقعا عجیب بود!! ولی خب رفته رفته دانشگاه رو خراب کردن متاسفانه!!
  //   از همه اینا بگذریم، چون زیادی دارم از تایتل این مطلب فاصله میگیرم!
  //   من یه آدم گیک ام(کسایی که یه خورده برنامه نویس ان میدونن چی میگم! فوش نمیدم :) ) کنار این روحیه عاشق یادگیری و ریاضی و کامپیوتر و الگوریتم ها بودن، علاقه زیادی به بحث های سیاسی و نظامی هم داشتم! یه جوری که مربی یه سری مسائل توی بسیج بودم! ینی من هم یه آدم مذهبی حساب میشم، ولی نه مثل این آدم های این دانشگاه، خیلی خشک و افراطی! که به قول امام خمینی (ره) مملکت هر مشکلی داره به خاطر همین جامعه افراطی هست!
  //   با این شرایط، فکر کن سال کنکورت واقعا خودت رو در حد مرگ جر بدی و روزی 17 ساعت بخونی!! ساعات مفید مطالعت هر روز بالای ده ساعت باشه!!! و در آخر هم یه رشته تقریبا مرتبط با روحیاتت یه جای خوب قبول بشی، اما یک نفر بگه باید بری امام صادق، با این شرایط لعنتی :)
  //   من واقعا توی برنامه نویسی و کامپیوتر ادعا دارم. خیلی ها هم بهم گفتن که واقعا توی این زمینه استعداد دارم! بدون هیچ امکاناتی، توی المپیاد کامپیوتر تا مرحله دومش هم رفتم!! این امکانات توی این موضوع خیلی مهمه! چون مباحث المپیاد خیلی فراتر از مباحثی هست که توی مدرسه و ... آموزش میدن و در حد دانشگاه هست، و همه مدارس غیر عادی برای اینها سرمایه گذاری میکنن و مطالب رو به داوطلبای المپیاد میگن! اما اون زمان من فقط خودم بودم و خودم! و واقعا مسیر برام سخت تر بود!! باید راهش رو پیدا کنم توی المپیاد دانشجوییش هم شرکت کنم!
  //   ولی خب اینا رو گفتم که بگم تنها استعداد، علاقه و همه چیزی که بلدم کامپیوتره! اما به خاطر یه شرایطی، به اجبار اومدم توی این دانشگاه ... :) 
  //   و اینه که همیشه این شعر توی ذهنم میاد و میره: 
  //   (البته نمیشه بهش گفت شعر 😂😂)
  //     حیف، حیف استعدادم!
  //     بیخودی گوش به این قصه دادم!
  //     فک نکن که حس بهت دارم!
  //     من دیگه پی استعفامم! :)
  //     هرجا میرم، هردری زدم!
  //     ولی باز باهام تو هر وری بدن!
  //     هر روز از روی قبل خطری تر،
  //     اما مخ تعطیلات و بدتری منم ... :)
    
  //   من واقعا از این شعرا و آهنگا گوش نمیدم 😂😂 عموما فقط شجریان و یا محمود کریمی گوش میدم، ولی این یه تیکه قشنگ حس و حالمه توی این دانشگاه :)
  //   شاید بگین انقد نق نزن، اگه واقعا اذیتی انصراف بده و برو دنبال علاقت! برو دنبال اون کاری که واقعا میخوای بکنی!!
  //   ولی خب؛ هرکی از بیرون این قضیه رو نگاه کنه همینو میگه! واقعا جای من نیستین بدونین که واقعا این کار غیر ممکنه :)
  //   هعی`,
  //   image: '', // اختیاری
  //   date: "1404/8/6",
  // },
  // {
  //   title: 'امام صادق، علمی یا الکی؟',
  //   content: `امروز شنبست، روز اول هفته و مسخره ترین روز. چون صبح زود تا ظهر کلا با عربی سر و کار داریم. اما واقعا رشته اقتصاد رو چه به عربی؟ خبب. اینجا بر میگرده به فلسفه دانشگاه امام صادق.
  //   تو دانشگاه به طرز عجیبی علاوه بر دروس اصلی که توی دانشگاه های دیگه خونده میشه، کلی دروس اضافه دیگه هم خونده میشه. مثل قواعد عربی، مکالمه عربی، قرائت و تجوید، فقه و ... که شاید هیچ کدوم به اقتصاد و یا رشته های دیگه ربطی نداشته باشه. همچنین دانشگاه خییلی تاکید روی این دروس هم داره که این واقعا اشتباهه.
  //   توی این شرایط، دانشجو به جای اینکه تمام تمرکزش رو روی دروس اصلی خودش بزاره، مجبوره تمرکزش رو تقسیم کنه و به دروس اضافه هم بپردازه. خبب، در این صورت بازدهی دروس اصلی کمتر میشه! بعد توقع دارن مملکت درست بشه!! :)
  //   به خاطر این دروس اضافه، تو به هیچ وجه نمیتونی توی یک ترم کمتر از 20 واحد برداری و اگه احیانا یکی از دروس رو بیوفتی، به معنای واقعی بدبخت میشی. چون دیگه تا آخر دانشگاه نمیتونی اونو برداری و پاس کنی! همش پره!! باید یک ترم معدل الف بشه که بتونه ترم بعدش 24 واحد برداره و اون رو پاس کنه. با این شرایط اینجا نمره مشروطی 14 هست :) یعنی رسما تو نمیتونی درس نخونی و برای دروس عمومی به درد نخور وقت نزاری!
  //   خب تو این شرایط، دانشجو کلی هزینه داره!! باید کار هم بکنه!! ولی خب اگه یهو مشروط بشی، بد بخت میشی!! آخرش نمیتونی تموم کنی و باید پول تموم اون سال ها که درس خوندی رو بدی :)
  //   به خاطر همین دروس چرت و پرت عمومی که وقت دانشجو رو میگیره و کلی مسائل دیگه که اگه بخوام بگم مطلب زیاد میشه و سایت کند میشه، دانشگاه ها و شرکت های داخلی و خارجی مدرک دانشگاه امام صادق رو قبول ندارن!! ینی 7 سال الکی درس میخونی تقریبا برای هیچی!! تو در هر صورت باید دکترا قبول بشی و بری یه دانشگاه دیگه درس بخونی تا مدرکت بشه معتبر!!
  //   خلاصه که واقعا دانشگاه مسخره ای عه!! الان هم سر کلاسم نمیتونم زیاد بنویسم!! در ادامه بیشتر مینویسم :) 
  //   من نمیدونم کسی این رو میخونه یا نه، ولی اگه داری میخونی، به هیچ وجه من الوجوه اگه آیندت رو دوست داری، به نظر من اصلا نیا این دانشگاه!! 
  //   واقعا بدبخت میشی!
  //   من خودم میدونم که آیندم رو خراب کردم و قرار نیست احتمالا به جایی که دوست دارم برسم!! اما خببب! خری عه که در خونم نشسته دیگه :)
  //   شاید بعد از اینکه مدرک اینجا رو گرفتم، دوباره برم کنکور بدم و چیزی که میخواستم بخونم رو یه جای دیگه (حتی آزاد) بخونم ...
  //   یعنی آزاد شرف داره به امام صادق! حالا بعدا بیشتر مینویسم :)`,
  //   image: '', // اختیاری
  //   date: '1404/7/26',
  // },
  {
    title: "چجوری مینویسم؟",
    content: `خبب. من که پول سرور نداشتم، برا همین روی گیت هاب پیج اینو آوردم بالا. اما خبب میدونین که نمیشه براش بک اند نوشت 😂😂 ینی نه پنل ادمین دارم، نه محاسبات سمت سرور، نه دیتابیس و نه هیچی. فقط یه فایل اچ دی ام ال و دوتا جاوا اسکریپت و یه سی اس اس. 
    ولی خب با این وضعیت چجوری میتونم بنویسم؟😂
    خبب. هر سری میام تو کامپیتر توی فایل config.js یه مطلب اضاف میکنم :) همه چی دستی.
    بعدشم روی گیت آپدیتش میکنم و تمام. الان یه مطلب جدید بارگزاری شد😂
    ولی خب بعد یه مدت فایل کانفیگم خیلی سنگین میشه و ساید عجیب غریب کند میشه (همین الانش هم کنده :) ). پس فقط میتونم یه تعداد محدودی بنویسم  هر سری باید قدیمی ها رو پاک کنم.
    آخرش هم بعد همه تغیرا باید روی گیت آپدیتش کنم :) اینو البته فک کنم گفته بودم دوباره.
    خلاصه که این کار خیییلی رو مخه و خیلی هر سری طول میکشه (شایدم کم طول بکشه) ولی به هر حال رو مخه.
    باید سر فرصت یه برنامه بنویسم که یه ui بیسیک داشته باشه و توی اون مطلب جدید رو اضاف کنم، بعد اگه مطالب از یه تعداد بیشتر شده بود خودش بیاد آخری رو حذف کنه، بعد با گیت آپدیتش کنه.
    ولی خب فعلا فرصت نیست 😂
    احتمالا با تکینتر یو آیش رو پیاده کنم. چون من فقط یه چیز ساده میخوام، کار دیگه ای ندارم. :)`,
    image: '', // اختیاری
    date: "1404/7/24"
  },
  {
    title: "طراحی سایت",
    content: `امروز داشتم همینجوری فک میکردم، بعد به خودم گفتم تو که طراحی سایت بلدی، چرا برا خودت سایت نساختی تاحالا؟:)
    خببب! پول هاست و سرور نداشتم 😂😂
    اما یهو به ذهنم خورد که اِاِاِ! من گیت هاب که میزاره یه سایت استاتیک درست کنیم! چرا تاحالا نکرده بودم؟!
    خبب، شاید فقط از اون داینامیکا دوس داشتم :)
    ولی خب به هر حال زشته یه برنامه نویس وب خودش سایت نداشته باشه! اومدم اینو امروز ساختم. همین :)`,
    image: '', // اختیاری
    date: "1404/7/22"
  },
];
