const config = {
    name: ' سید پارسا حسینی',
    bio: 'برنامه نویس جنگو',
    instagram: 'https://instagram.com/seyed_parsa_jan',
    telegram: 'https://t.me/OseyedO',
    github: 'https://github.com/seyed-jan',
    email: '',
    cv: '',
    profileImage: 'profile.png',
    favicon: 'profile.png', 
    about: 'همه چی از کلاس ششم شروع شد. اون سالی که توی مدرسه بهمون یه ذره کوچولو icdl یاد میدادن. همون یه جرقه تو ذهنم شد که برم کامپیتر یاد بگیرم :) یادمه اون زمان استاد ورد و پاور پوینت و ... شده بودم😂 یه سال بعدش رفتم مغازه تعمیرات کامپیوتر و تا میتونستم یاد گرفتم :) تا جایی که دیگه دیدم چیزی برای یاد گرفتن ندارم. واسه همین رفتم سمت گرافیک و تدوین و موشن گرافیک 😁 خلاصه طی یه سری اتفاق ها اومدم سمت برنامه نویسی و الان 5 شیش سالی هست که برنامه نویسم 🙄🙃 الان هم به طرز عجیبی اومدم دانشگاه امام صادق و دارم اقتصاد میخونم. 😂😂',
    };

// const projects = [
//     {title:'پروژه اول',description:'توضیح کوتاه<br> پروژه اول',image:'profile.png',link:''},
//     {title:'پروژه دوم',description:'توضیح کوتاه پروژه دوم',image:'P2',link:''},
//     {title:'مینی پروژه',description:'یک کار کوچک و بامزه',image:'MP',link:''},
//     {title:'رندر ویدیو',description:'تدوین و صداگذاری نمونه',image:'VD',link:''},
//     {title:'پروژه اول',description:'توضیح کوتاه پروژه اول',image:'P1',link:''},
//     {title:'پروژه دوم',description:'توضیح کوتاه پروژه دوم',image:'P2',link:''},
//     {title:'مینی پروژه',description:'یک کار کوچک و بامزه',image:'MP',link:''},
//     {title:'رندر ویدیو',description:'تدوین و صداگذاری نمونه',image:'VD',link:''},
//     ];

const posts = [
  // {
  //   title: '',
  //   content: ``,
  //   image: '', // اختیاری
  //   date: "",
  // },
  {
    title: 'امام صادق، علمی یا الکی؟',
    content: `امروز شنبست، روز اول هفته و مسخره ترین روز. چون صبح زود تا ظهر کلا با عربی سر و کار داریم. اما واقعا رشته اقتصاد رو چه به عربی؟ خبب. اینجا بر میگرده به فلسفه دانشگاه امام صادق.
    تو دانشگاه به طرز عجیبی علاوه بر دروس اصلی که توی دانشگاه های دیگه خونده میشه، کلی دروس اضافه دیگه هم خونده میشه. مثل قواعد عربی، مکالمه عربی، قرائت و تجوید، فقه و ... که شاید هیچ کدوم به اقتصاد و یا رشته های دیگه ربطی نداشته باشه. همچنین دانشگاه خییلی تاکید روی این دروس هم داره که این واقعا اشتباهه.
    توی این شرایط، دانشجو به جای اینکه تمام تمرکزش رو روی دروس اصلی خودش بزاره، مجبوره تمرکزش رو تقسیم کنه و به دروس اضافه هم بپردازه. خبب، در این صورت بازدهی دروس اصلی کمتر میشه! بعد توقع دارن مملکت درست بشه!! :)
    به خاطر این دروس اضافه، تو به هیچ وجه نمیتونی توی یک ترم کمتر از 20 واحد برداری و اگه احیانا یکی از دروس رو بیوفتی، به معنای واقعی بدبخت میشی. چون دیگه تا آخر دانشگاه نمیتونی اونو برداری و پاس کنی! همش پره!! باید یک ترم معدل الف بشه که بتونه ترم بعدش 24 واحد برداره و اون رو پاس کنه. با این شرایط اینجا نمره مشروطی 14 هست :) یعنی رسما تو نمیتونی درس نخونی و برای دروس عمومی به درد نخور وقت نزاری!
    خب تو این شرایط، دانشجو کلی هزینه داره!! باید کار هم بکنه!! ولی خب اگه یهو مشروط بشی، بد بخت میشی!! آخرش نمیتونی تموم کنی و باید پول تموم اون سال ها که درس خوندی رو بدی :)
    به خاطر همین دروس چرت و پرت عمومی که وقت دانشجو رو میگیره و کلی مسائل دیگه که اگه بخوام بگم مطلب زیاد میشه و سایت کند میشه، دانشگاه ها و شرکت های داخلی و خارجی مدرک دانشگاه امام صادق رو قبول ندارن!! ینی 7 سال الکی درس میخونی تقریبا برای هیچی!! تو در هر صورت باید دکترا قبول بشی و بری یه دانشگاه دیگه درس بخونی تا مدرکت بشه معتبر!!
    خلاصه که واقعا دانشگاه مسخره ای عه!! الان هم سر کلاسم نمیتونم زیاد بنویسم!! در ادامه بیشتر مینویسم :) 
    من نمیدونم کسی این رو میخونه یا نه، ولی اگه داری میخونی، به هیچ وجه من الوجوه اگه آیندت رو دوست داری، به نظر من اصلا نیا این دانشگاه!! 
    واقعا بدبخت میشی!
    من خودم میدونم که آیندم رو خراب کردم و قرار نیست احتمالا به جایی که دوست دارم برسم!! اما خببب! خری عه که در خونم نشسته دیگه :)
    شاید بعد از اینکه مدرک اینجا رو گرفتم، دوباره برم کنکور بدم و چیزی که میخواستم بخونم رو یه جای دیگه (حتی آزاد) بخونم ...
    یعنی آزاد شرف داره به امام صادق! حالا بعدا بیشتر مینویسم :)`,
    image: '', // اختیاری
    date: '1404/7/26',
  },
  {
    title: "چجوری مینویسم؟",
    content: `خبب. من که پول سرور نداشتم، برا همین روی گیت هاب پیج اینو آوردم بالا. اما خبب میدونین که نمیشه براش بک اند نوشت 😂😂 ینی نه پنل ادمین دارم، نه محاسبات سمت سرور، نه دیتابیس و نه هیچی. فقط یه فایل اچ دی ام ال و دوتا جاوا اسکریپت و یه سی اس اس. 
    ولی خب با این وضعیت چجوری میتونم بنویسم؟😂
    خبب. هر سری میام تو کامپیتر توی فایل config.js یه مطلب اضاف میکنم :) همه چی دستی.
    بعدشم روی گیت آپدیتش میکنم و تمام. الان یه مطلب جدید بارگزاری شد😂
    ولی خب بعد یه مدت فایل کانفیگم خیلی سنگین میشه و ساید عجیب غریب کند میشه (همین الانش هم کنده :) ). پس فقط میتونم یه تعداد محدودی بنویسم  هر سری باید قدیمی ها رو پاک کنم.
    آخرش هم بعد همه تغیرا باید روی گیت آپدیتش کنم :) اینو البته فک کنم گفته بودم دوباره.
    خلاصه که این کار خیییلی رو مخه و خیلی هر سری طول میکشه (شایدم کم طول بکشه) ولی به هر حال رو مخه.
    باید سر فرصت یه برنامه بنویسم که یه ui بیسیک داشته باشه و توی اون مطلب جدید رو اضاف کنم، بعد اگه مطالب از یه تعداد بیشتر شده بود خودش بیاد آخری رو حذف کنه، بعد با گیت آپدیتش کنه.
    ولی خب فعلا فرصت نیست 😂
    احتمالا با تکینتر یو آیش رو پیاده کنم. چون من فقط یه چیز ساده میخوام، کار دیگه ای ندارم. :)`,
    image: '', // اختیاری
    date: "1404/7/24"
  },
  {
    title: "طراحی سایت",
    content: `امروز داشتم همینجوری فک میکردم، بعد به خودم گفتم تو که طراحی سایت بلدی، چرا برا خودت سایت نساختی تاحالا؟:)
    خببب! پول هاست و سرور نداشتم 😂😂
    اما یهو به ذهنم خورد که اِاِاِ! من گیت هاب که میزاره یه سایت استاتیک درست کنیم! چرا تاحالا نکرده بودم؟!
    خبب، شاید فقط از اون داینامیکا دوس داشتم :)
    ولی خب به هر حال زشته یه برنامه نویس وب خودش سایت نداشته باشه! اومدم اینو امروز ساختم. همین :)`,
    image: '', // اختیاری
    date: "1404/7/22"
  },
];
